#!/bin/bash

# Запрос исходной и целевой директории у пользователя
read -p "Введите новое расширение для файлов (без точки): " new_file_extension
echo "Вы ввели новое расширение: .$new_file_extension"

# Запрос расширения файлов, которые нужно скопировать

# Запросить новое расширение для файлов.

# Проверка существования исходной директории и целевой директории


# Проверка, есть ли файлы с указанным расширением в исходной директории

# Копирование файлов с указанным расширением в целевую директорию

# Архивация исходных файлов.

