#!/bin/bash

# Перевіряємо, чи поточна директорія є git-репозиторієм
if git rev-parse --is-inside-work-tree > /dev/null 2>&1; then
  echo "Поточна директорія є git-репозиторієм."

  # Додаємо всі зміни до індексу
  git add .

  # Створюємо комміт з автоматично згенерованим повідомленням
  commit_message="Автоматический коммит $(date +'%Y-%m-%d %H:%M:%S')"
  git commit -m "$commit_message"

  if [ $? -eq 0 ]; then
    echo "Зміни успішно закоммічені з повідомленням: '$commit_message'"
  else
    echo "Не вдалося створити комміт. Можливо, немає змін для комміту або виникла інша помилка."
  fi
else
  echo "Поточна директорія не є git-репозиторієм."
fi
